app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 36 LIMIT 1
DELETE FROM "movies" WHERE "movies"."id" = 36
---
  def destroy
    @movie = Movie.find_by(:id => params["id"])
    @movie.delete

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 36 LIMIT 1
---
  def show
    @movie = Movie.find_by(:id => params["id"])